---
kind: method
id: M:Autodesk.Revit.DB.FabricationAncillaryUsage.Dispose
source: html/3a785976-c892-9f25-bb13-a7ff69b9dc2e.htm
---
# Autodesk.Revit.DB.FabricationAncillaryUsage.Dispose Method

Releases all resources used by the FabricationAncillaryUsage

## Syntax (C#)
```csharp
public void Dispose()
```